//#include<stdio.h>
//int main()
//{
//	//int a = 1;
//	//int b = 2;
//	//int* p = &a;
//	//int** pp = &p;
//	//printf("%p\n", pp);
//	//
//	////作用1：修改一级指针记录的内存地址
//	//*pp = &b;
//	//printf("%d\n", *p);
//	////用二级指针获取到变量中记录的数据
//	//printf("%d\n", **pp);
//
//	//return 0;
//
//
//	//数组指针（是指向数组的指针）
//	/*int arr[] = { 10,20,30,40,50 };
//	int len = sizeof(arr) / sizeof(arr[0]);*/
//
//	//获取指针地址（数组的首地址）
//	/*int* p1 = arr;
//	
//	for (int i = 0; i < len; i++)
//	{
//		
//		printf("%d\n", *p1++);
//	}*/
//
//
//	//数组指针的细节
//	//int arr[] = { 1,2,3,4,5,6 };
//
//	//arr在参与运算时会退化为其指针
//	//&arr获取时不会退化(步长是数据类型*数组的长度)
//	//eg:
//	//printf("%p\n",arr);
//	//printf("%p\n",&arr);
//	//printf("%p\n",arr+1);//退化为指针
//	//printf("%p\n",&arr+1);//相差24个字节
//
//	//二维数组
//	/*格式1
//	int arr[i][j] = 
//	{
//		{1,2,3,4,5},
//		{11,22,33,44,55},        !!!
//		{111,222,333,444,555}
//	};                      !!!
//	*/
//	/*int arr[3][5] =
//	{
//		{1,2,3,4,5},
//		{11,22,33,44,55},
//		{111,222,333,444,555}
//	};
//		
//	for (int i = 0; i < 3; i++)
//	{
//		for (int j = 0; j < 5; j++)
//		{
//
//			printf("%d ", arr[i][j]);
//			
//		}
//		printf("\n");
//	}*/
//
//	/*
//	二维数组的第二种定义格式（指针数组）
//	//先定义一维数组，再将其指针存入数组中
//	*/
//	/*int arr1[] = { 1,2,3 };
//	int arr2[] = { 1,2,3,4,5};
//	int arr3[] = { 1,2,3,4,5,6,7,8};*/
//
//	//int* arr[] = { arr1,arr2,arr3 };
//	//int len1 = sizeof(arr1) / sizeof(int);
//	//int len2 = sizeof(arr2) / sizeof(int);
//	//int len3 = sizeof(arr3) / sizeof(int);
//	//int len[] = { len1,len2,len3 };//将长度定义为数组，便于下面获取
//
//	//for (int i = 0; i < 3; i++)
//	//{
//	//	for (int j = 0; j < len[i]; j++)
//	//	{
//	//		printf("%d ", arr[i][j]);
//	//	}
//	//	printf("\n");
//	//}
//
//
//	//利用指针遍历第一种格式的二维数组
//	/*int arr[3][5] =
//	{
//		{1,2,3,4,5},
//		{11,22,33,44,55},
//		{111,222,333,444,555}
//	};
//
//	int(*p)[5] = arr;
//	for (int i = 0; i < 3; i++)
//	{
//		for (int j = 0; j < 5; j++)
//		{
//			printf("%d ", *(*p + j));
//		}
//		printf("\n");
//		p++;
//	}*/
//
//
//	//数组指针和指针数组
//
////int(*p)[5] = arr;
////int *p[5] = {arr1,arr2};
//	
//	
//}